Revit 2027 API
DetailCurveArray Class
An array that can contain any type of object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DetailCurveArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DetailCurveArray : APIObject,
	IEnumerable
Public Class DetailCurveArray
	Inherits APIObject
	Implements IEnumerable
public ref class DetailCurveArray : public APIObject,
	IEnumerable
type DetailCurveArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The DetailCurveArray type exposes the following members.
Constructors
Name | Description
DetailCurveArray | Initializes a new instance of the DetailCurveArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Item | Gets or sets an item at a specified index within the array.
Size | Returns the number of objects that are in the array.
Top
Methods
Name | Description
Append
Clear | Removes every item from the array, rendering it empty.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert
ReverseIterator | Retrieve a backward moving iterator to the array.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace